In [1]:
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\samsung\appdata\roaming\python\python312\site-packages (1.1.1)

In [2]:
import pymysql
import pandas as pd

In [3]:
!pip install dotenv

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: dotenv in c:\users\samsung\appdata\roaming\python\python312\site-packages (0.9.9)
Requirement already satisfied: python-dotenv in c:\programdata\anaconda3\lib\site-packages (from dotenv) (0.21.0)

In [4]:
import dotenv
import os

In [5]:
dotenv.load_dotenv()

True

In [6]:
os.getenv('host')
int(os.getenv('port'))
os.getenv('user')
os.getenv('pwd')
os.getenv('db_name')

'ubion'

In [8]:
_db = pymysql.connect(
    host = os.getenv('host'),
    port = int(os.getenv('port')),
    user = os.getenv('user'),
    password = os.getenv('pwd'),
    db = os.getenv('db_name'),
)
_db

In [44]:
select_sql = """
    SELECT * 
    FROM `SALES RECORDS`;
"""

In [13]:
# CURSOR
import pymysql.cursors


cursor = _db.cursor() # 2차원 튜플 형태
cursor2 = _db.cursor(pymysql.cursors.DictCursor) # 리스트 안 딕셔너리 형태

In [51]:
cursor2.execute(select_sql)
cursor2.fetchone()

{'Region': 'Sub-Saharan Africa',
 'Country': 'Chad',
 'Item Type': 'Office Supplies',
 'Sales Channel': 'Online',
 'Order Priority': 'L',
 'Order Date': '1/27/2011',
 'Order ID': 292494523,
 'Ship Date': '2/12/2011',
 'Units Sold': 4484,
 'Unit Price': 651.21,
 'Unit Cost': 524.96,
 'Total Revenue': 2920025.64,
 'Total Cost': 2353920.64,
 'Total Profit': 566105.0}

In [19]:
insert_sql = """
    INSERT INTO
    `USER`
    VALUES
    ('test1','0011','choi','25');
"""

In [20]:
cursor.execute(insert_sql)

1

In [53]:
select_sql2 = "SELECT * FROM USER";
cursor.execute(select_sql2)
cursor.fetchall()

(('test1', '0011', 'choi', 25),
 ('test12', '1233', 'seo', 55),
 ('test2', '1111', 'park', 30))

In [24]:
_db.commit()

In [61]:
delete_sql1 = "delete from `user` where `id` = 'test1'"
cursor.execute(delete_sql1)
cursor.rowcount

0

- select 함수 생성
    1. 매개변수 (sql 쿼리)
    2. sql 쿼리를 cursor2에 보내기
    3. cursor에서 응답 데이터를 변수에 저장
    4. 3번 과정의 결과를 데이터프레임으로 생성
    5. 데이터프레임을 반환

In [25]:
def select_query(_sql):
    cursor2.execute(_sql)
    data = cursor2.fetchall()
    df = pd.DataFrame(data)
    return df

test_sql = "select * from `user`"
select_query(test_sql)

      id password  name  age
0   test     1234   kim   20
1  test1     0011  choi   25
2  test2     1111  park   30
3  test3     0000   lee   40

In [ ]:
def dml_query(_sql):
    cursor2.execute(_sql)
    if _sql.find("insert") or _sql.find("update"):
        print(cursor2.fetchall())
    else:
        print(cursor2.rowcount+ '가 선택되었습니다.')
        
    ok = input("확인 후 ok를 입력하시오 ")
    if ok == "ok":
        _db.commit()
        select = "select * from `user`"
        return select_query(select)
    else:
        print("commit 되지 않았습니다.")
    
# test_sql2 = "insert into `user` values('test12','1233','seo',55)"
# dml_query(test_sql2)

In [42]:
test_sql3 = "delete from `user` where `id` = 'test'"
dml_query(test_sql3)

[]
commit 되지 않았습니다.

In [39]:
i = "1234"
i.find("1")

0